In [17]:
#Importando bibliotecas
import pandas as pd
import numpy as np
import matplotlib as plt

In [44]:
#Importando tabelas Dimensão
df_agencia = pd.read_csv('d_agencia.csv')
df_canal = pd.read_csv('d_canal.csv')
df_data = pd.read_csv('d_data.csv')
df_hospede = pd.read_csv('d_hospede.csv')
df_hotel = pd.read_csv('d_hotel.csv')
df_cancelamento = pd.read_csv('d_motivo_cancelamento.csv')
df_plano = pd.read_csv('d_plano_tarifario.csv')
df_quarto = pd.read_csv('d_tipo_quarto.csv')

#Importando tabelas Fato
df_diarias = pd.read_csv('f_diarias.csv')
df_inventario = pd.read_csv('f_inventario_diario.csv')
df_pagamentos = pd.read_csv('f_pagamentos.csv')
df_reservas = pd.read_csv('f_reservas.csv')
df_reviews = pd.read_csv('f_reviews.csv')

In [ ]:
#Visualizando tabelas
df_agencia

   canal_id      canal_nome canal_grupo
0         1   Direto - Site      Direto
1         2    Direto - App      Direto
2         3   OTA - Booking         OTA
3         4   OTA - Decolar         OTA
4         5     Corporativo        Corp
5         6  Agência Física     Agência

In [10]:
df_canal

   canal_id      canal_nome canal_grupo
0         1   Direto - Site      Direto
1         2    Direto - App      Direto
2         3   OTA - Booking         OTA
3         4   OTA - Decolar         OTA
4         5     Corporativo        Corp
5         6  Agência Física     Agência

In [11]:
df_data

,data_id,data,ano,mes,nome_mes,trimestre,dia_semana,fim_de_semana_flag,feriado_flag,alta_temporada_flag
0,20240101,2024-01-01,2024,1,Jan,1,1,0,1,1
1,20240102,2024-01-02,2024,1,Jan,1,2,0,0,1
2,20240103,2024-01-03,2024,1,Jan,1,3,0,0,1
3,20240104,2024-01-04,2024,1,Jan,1,4,0,0,1
4,20240105,2024-01-05,2024,1,Jan,1,5,0,0,1
...,...,...,...,...,...,...,...,...,...,...
726,20251227,2025-12-27,2025,12,Dec,4,6,1,0,1
727,20251228,2025-12-28,2025,12,Dec,4,7,1,0,1
728,20251229,2025-12-29,2025,12,Dec,4,1,0,0,1
729,20251230,2025-12-30,2025,12,Dec,4,2,0,0,1
730,20251231,2025-12-31,2025,12,Dec,4,3,0,0,1

In [12]:
df_hospede

       hospede_id    pais  uf          cidade faixa_etaria segmento
0               1  Brasil  CE       Fortaleza        46-60     Corp
1               2  Brasil  RJ         Niterói        36-45    Lazer
2               3  Brasil  MG  Belo Horizonte        26-35    Lazer
3               4  Brasil  DF        Brasília        26-35    Lazer
4               5  Brasil  ES         Vitória        26-35    Lazer
...           ...     ...  ..             ...          ...      ...
11995       11996  Brasil  SC   Florianópolis        26-35    Lazer
11996       11997  Brasil  CE       Fortaleza        18-25     Corp
11997       11998  Brasil  MG  Belo Horizonte        18-25    Lazer
11998       11999  Brasil  CE       Fortaleza          60+    Lazer
11999       12000  Brasil  PR        Curitiba        26-35     Corp

[12000 rows x 6 columns]

In [13]:
df_hotel

,hotel_id,nome,cidade,uf,categoria_estrelas,possui_spa_flag
0,1,Nara Copacabana,Rio de Janeiro,RJ,4,1
1,2,Nara Paulista,São Paulo,SP,4,0
2,3,Nara Savassi,Belo Horizonte,MG,3,0
3,4,Nara Barra,Salvador,BA,4,1
4,5,Nara Batel,Curitiba,PR,3,0
5,6,Nara Meireles,Fortaleza,CE,5,1

In [14]:
df_cancelamento

   motivo_id              categoria                   descricao
0          1                  Preço     Encontrou tarifa melhor
1          2      Mudança de planos         Alteração de agenda
2          3  Problema de pagamento             Cartão recusado
3          4             Transporte  Cancelamento de voo/ônibus
4          5                 Outros        Motivo não informado

In [15]:
df_plano

,rate_plan_id,nome_plano,reembolsavel_flag,cafe_incluso_flag,politica_cancelamento
0,1,Flexível (Reembolsável),1,1,Cancelamento grátis até 48h antes
1,2,Não Reembolsável,0,0,Sem reembolso
2,3,Corporativo Flex,1,1,Cancelamento grátis até 24h antes
3,4,Pacote Fim de Semana,0,1,Sem reembolso
4,5,Promo Antecipada,0,0,Sem reembolso

In [16]:
df_quarto

   tipo_quarto_id tipo_quarto  capacidade
0               1    Standard           2
1               2    Superior           2
2               3      Deluxe           3
3               4       Suite           3
4               5     Familia           4

In [27]:
df_inventario

,hotel_id,data_id,tipo_quarto,quartos_total,quartos_manutencao,quartos_disponiveis
0,1,20240101,Standard,55,2,53
1,1,20240102,Standard,55,2,53
2,1,20240103,Standard,55,0,55
3,1,20240104,Standard,55,1,54
4,1,20240105,Standard,55,0,55
...,...,...,...,...,...,...
21925,6,20251227,Familia,20,0,20
21926,6,20251228,Familia,20,0,20
21927,6,20251229,Familia,20,1,19
21928,6,20251230,Familia,20,1,19
21929,6,20251231,Familia,20,1,19

In [46]:
df_diarias

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias
0,1,20240101,Standard,37,367.51,13597.84
1,1,20240102,Standard,39,424.36,16549.95
2,1,20240103,Standard,32,350.25,11207.86
3,1,20240104,Standard,35,309.44,10830.30
4,1,20240105,Standard,54,332.37,17948.08
...,...,...,...,...,...,...
21925,6,20251227,Familia,14,763.34,10686.69
21926,6,20251228,Familia,16,709.42,11350.74
21927,6,20251229,Familia,14,644.95,9029.31
21928,6,20251230,Familia,13,869.08,11298.06
21929,6,20251231,Familia,14,748.11,10473.53

In [60]:
#Achando diárias com receita negativa
df_diarias_negativas = df_diarias.loc[df_diarias['receita_diarias'] < 0]
df_diarias_negativas

Empty DataFrame
Columns: [hotel_id, data_id, tipo_quarto, quartos_vendidos, adr_estimado, receita_diarias]
Index: []

In [59]:
#Transformando valores negativos em positivos
coluna = 'receita_diarias'
df_diarias[coluna] = np.where(df_diarias[coluna] < 0, df_diarias[coluna] * -1, df_diarias[coluna])

In [24]:
#Cálculo das medidas estatísticas
array_adr = np.array(df_diarias['adr_estimado'])
media = np.mean(array_adr)
mediana = np.median(array_adr)
q1 = np.quantile(array_adr, 0.25)
q2 = np.quantile(array_adr, 0.50)
q3 = np.quantile(array_adr, 0.75)
distancia = (media-mediana)/ mediana

#Cálculo dos limites para detecção de outliers
iqr = q3 - q1
limite_superior = q3 + 1.5 * iqr
limite_inferior = q1 - 1.5 * iqr

#Resultados
print(f'A média é {media}')
print(f'A mediana é {mediana}')
print(f'Primeiro quartil (Q1): {q1}')
print(f'Segundo quartil (Q2, Mediana): {q2}')
print(f'Terceiro quartil (Q3): {q3}')
print(f'a distancia entre a média e a mediana é: {distancia}')
print(f'o valor do limite superior é: {limite_superior}')
print(f'o valor do limite inferior é: {limite_inferior}')

A média é 508.78171637026907
A mediana é 480.435
Primeiro quartil (Q1): 367.9975
Segundo quartil (Q2, Mediana): 480.435
Terceiro quartil (Q3): 611.7375
a distancia entre a média e a mediana é: 0.05900218837151553
o valor do limite superior é: 977.3474999999999
o valor do limite inferior é: 2.3875000000001023

In [50]:
#Identificação de outliers
outliers_adr = df_diarias.loc[df_diarias['adr_estimado'] > limite_superior]
outliers_adr

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias
118,1,20240428,Standard,28,2682.70,75115.66
213,1,20240801,Standard,32,1696.01,54272.46
499,1,20250514,Standard,28,1529.24,42818.78
565,1,20250719,Standard,45,2866.73,129003.06
700,1,20251201,Standard,33,1921.82,63420.22
...,...,...,...,...,...,...
21198,6,20251231,Suite,7,985.31,6897.16
21246,6,20240217,Familia,14,1009.50,14133.02
21344,6,20240525,Familia,14,4405.16,61672.24
21376,6,20240626,Familia,11,2446.84,26915.25
21862,6,20251025,Familia,13,2626.18,34140.38

In [26]:
#Exportando Outliers para CSV
outliers_adr.to_csv("Diaria_Outliers.csv", sep=';', index=False)

In [25]:
#Criando CSV sem outliers
inliers_adr = df_diarias.loc[df_diarias['adr_estimado'] < limite_superior]
inliers_adr.to_csv("Diaria_s_Outliers.csv", sep=';', index=False)

In [66]:
#Copiando a tabela de diárias para análise de overbooking
df_overbooking = df_diarias.copy()
#Adicionando a coluna de quartos disponíveis
df_overbooking['quartos_disponiveis']= df_inventario['quartos_disponiveis'].astype(int)
#Criando DF para cálculo de RevPAR
df_revpar = df_overbooking.copy()
#Criando a coluna de overbooking(quartos disponíveis - quartos vendidos)
df_overbooking['overbooking'] = df_overbooking['quartos_disponiveis'] - df_overbooking['quartos_vendidos']
#Achando os casos de overbooking
df_overbooking = df_overbooking.loc[df_overbooking['overbooking'] < 0]
#Criando CSV de overbooking
df_overbooking.to_csv("Overbooking.csv", sep=';', index=False)
df_overbooking

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_disponiveis,overbooking
6230,2,20250117,Suite,11,822.28,9045.11,10,-1
10939,3,20251206,Familia,11,579.32,6372.51,10,-1
13250,4,20240402,Suite,10,657.86,6578.61,9,-1
13856,4,20251129,Suite,11,795.07,8745.74,10,-1
13962,4,20240314,Familia,17,519.29,8827.86,16,-1
16818,5,20240106,Suite,10,838.35,8383.52,7,-3
17182,5,20250104,Suite,8,959.70,7677.60,7,-1
17407,5,20250817,Suite,8,580.19,4641.52,7,-1
21383,6,20240703,Familia,21,641.21,13465.47,19,-2

In [25]:
df_pagamentos

,pagamento_id,reserva_id,data_pagamento_id,forma_pagamento,valor_pago,status_pagamento,taxa_gateway
0,1,1,20240224,Crédito,892.93,Aprovado,25.00
1,2,3,20241225,Crédito,218.23,Estornado,6.11
2,3,3,20241226,Crédito,224.66,Aprovado,6.29
3,4,4,20250319,PIX,263.71,Aprovado,3.16
4,5,6,20240404,Crédito,3415.63,Aprovado,95.64
...,...,...,...,...,...,...,...
31564,31565,31996,20250831,Boleto,303.70,Aprovado,3.64
31565,31566,31997,20250621,Crédito,1944.31,Aprovado,54.44
31566,31567,31998,20240629,Boleto,1688.68,Aprovado,20.26
31567,31568,31999,20250211,Crédito,457.45,Aprovado,12.81
31568,31569,32000,20250704,PIX,2127.29,Aprovado,25.53

In [26]:
df_reservas

,reserva_id,data_reserva_id,data_cancelamento_id,motivo_cancelamento_id,checkin_id,checkout_id,hotel_id,hospede_id,canal_id,agencia_id,rate_plan_id,tipo_quarto,status,adultos,criancas,valor_previsto,desconto,moeda
0,1,20240229,NaN,NaN,20240301,20240302,5,10394,1,NaN,5,Suite,Finalizada,2,2,909.80,0.00,BRL
1,2,20250522,20250610.0,2.0,20250622,20250625,5,10147,4,2.0,5,Deluxe,Cancelada,2,0,1533.72,0.00,BRL
2,3,20241209,NaN,NaN,20241228,20241229,5,11484,1,NaN,2,Superior,Finalizada,1,1,436.38,0.00,BRL
3,4,20250306,NaN,NaN,20250323,20250324,2,7030,2,NaN,3,Superior,Finalizada,2,1,270.76,0.00,BRL
4,5,20240423,20240504.0,2.0,20240527,20240528,5,4216,1,NaN,3,Deluxe,Cancelada,1,2,318.75,0.00,USD
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32075,2684,20240118,NaN,NaN,20240124,20240125,2,4916,5,NaN,4,Deluxe,Finalizada,2,2,487.25,0.00,BRL
32076,21255,20240724,NaN,NaN,20240801,20240803,1,5722,1,NaN,1,Deluxe,Finalizada,1,2,1128.11,0.00,BRL
32077,25301,20240529,NaN,NaN,20240610,20240611,5,2094,1,NaN,1,Standard,Finalizada,1,2,225.91,16.67,BRL
32078,10869,20250228,20250305.0,3.0,20250309,20250312,2,11906,5,NaN,1,Standard,Cancelada,2,0,782.05,0.00,BRL
32079,15432,20240523,20240524.0,5.0,20240527,20240531,6,8623,5,NaN,3,Familia,Cancelada,1,1,1291.48,0.00,BRL

In [ ]:
#Achando reservas duplicadas
df_reservas.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
32075     True
32076     True
32077     True
32078     True
32079     True
Length: 32080, dtype: bool

In [ ]:
#Removendo reservas duplicadas
df_reservas.drop_duplicates(inplace=True)
df_reservas

,reserva_id,data_reserva_id,data_cancelamento_id,motivo_cancelamento_id,checkin_id,checkout_id,hotel_id,hospede_id,canal_id,agencia_id,rate_plan_id,tipo_quarto,status,adultos,criancas,valor_previsto,desconto,moeda
0,1,20240229,NaN,NaN,20240301,20240302,5,10394,1,NaN,5,Suite,Finalizada,2,2,909.80,0.00,BRL
1,2,20250522,20250610.0,2.0,20250622,20250625,5,10147,4,2.0,5,Deluxe,Cancelada,2,0,1533.72,0.00,BRL
2,3,20241209,NaN,NaN,20241228,20241229,5,11484,1,NaN,2,Superior,Finalizada,1,1,436.38,0.00,BRL
3,4,20250306,NaN,NaN,20250323,20250324,2,7030,2,NaN,3,Superior,Finalizada,2,1,270.76,0.00,BRL
4,5,20240423,20240504.0,2.0,20240527,20240528,5,4216,1,NaN,3,Deluxe,Cancelada,1,2,318.75,0.00,USD
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
31995,31996,20250823,NaN,NaN,20250828,20250829,6,9442,1,NaN,4,Superior,Finalizada,2,1,304.80,32.34,BRL
31996,31997,20250604,NaN,NaN,20250622,20250629,2,5559,5,NaN,3,Standard,Finalizada,1,1,1917.83,176.01,BRL
31997,31998,20240630,NaN,NaN,20240701,20240703,5,6023,4,2.0,3,Suite,Finalizada,2,2,1726.00,0.00,BRL
31998,31999,20241008,NaN,NaN,20250217,20250218,4,11006,4,2.0,2,Superior,Finalizada,2,0,458.12,0.00,BRL
31999,32000,20250630,NaN,NaN,20250710,20250714,6,3754,2,NaN,5,Standard,Finalizada,1,0,2097.42,0.00,BRL

In [27]:
df_reviews

,review_id,reserva_id,data_review_id,nota,limpeza,localizacao,atendimento,comentario_flag
0,1,4081,20240528,7.7,7.3,8.5,7.9,0
1,2,1095,20250816,9.0,8.8,8.6,7.4,0
2,3,12895,20250320,8.6,7.8,9.0,9.5,1
3,4,25185,20251017,6.4,6.2,5.9,6.5,0
4,5,13176,20241128,8.9,9.3,9.4,8.5,0
...,...,...,...,...,...,...,...,...
10767,10768,4983,20240425,7.7,7.6,8.0,8.0,1
10768,10769,31831,20240908,6.2,6.9,6.5,6.3,1
10769,10770,9662,20251225,5.4,5.7,5.7,5.5,0
10770,10771,22855,20250802,7.3,8.0,6.6,7.3,0
10771,10772,21865,20251031,9.1,9.3,8.1,9.8,0

In [49]:
df_reviews_notas = df_reviews.loc[df_reviews['nota'] > 10]
df_reviews_notas

,review_id,reserva_id,data_review_id,nota,limpeza,localizacao,atendimento,comentario_flag
2272,2273,19799,20240930,11.0,9.3,9.5,9.1,1
2476,2477,20089,20241220,11.0,10.0,10.0,10.0,0
2923,2924,25900,20251024,11.0,6.1,6.9,5.7,0
3541,3542,29229,20241122,11.0,8.4,7.4,5.7,0
3596,3597,5643,20240301,11.0,8.4,8.4,7.8,0
3963,3964,4334,20241208,11.0,6.9,7.7,7.2,1
6070,6071,9664,20251124,11.0,8.5,7.6,7.6,0
6428,6429,24249,20260120,11.0,7.0,7.5,5.8,0
6450,6451,7167,20250907,11.0,7.3,6.6,5.9,0
8108,8109,28574,20241026,11.0,8.8,8.9,9.1,1
8264,8265,10456,20240719,11.0,8.8,9.1,9.0,1
8265,8266,68,20251222,11.0,6.0,7.5,6.9,1
8704,8705,2420,20260106,11.0,8.4,7.8,9.3,0
8896,8897,29549,20251009,11.0,10.0,9.0,8.6,1
8978,8979,28788,20240919,11.0,8.1,7.7,8.0,1
9989,9990,19968,20251104,11.0,6.2,7.6,5.8,1

In [75]:

df_revpar['revpar'] = df_revpar['receita_diarias'] / df_revpar['quartos_disponiveis']
df_revpar['ocupacao'] = df_revpar['quartos_vendidos'] / df_revpar['quartos_disponiveis']*100
df_alto_revpar = df_revpar.loc[df_revpar['revpar'] > 1000 ]
df_alto_revpar

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_disponiveis,revpar,ocupacao
118,1,20240428,Standard,28,2682.70,75115.66,50,1502.313200,56.000000
213,1,20240801,Standard,32,1696.01,54272.46,53,1024.008679,60.377358
565,1,20250719,Standard,45,2866.73,129003.06,54,2388.945556,83.333333
700,1,20251201,Standard,33,1921.82,63420.22,55,1153.094909,60.000000
911,1,20240629,Superior,31,2545.23,78902.00,40,1972.550000,77.500000
...,...,...,...,...,...,...,...,...,...
20620,6,20240601,Suite,10,3739.54,37395.36,15,2493.024000,66.666667
20780,6,20241108,Suite,7,5103.67,35725.67,14,2551.833571,50.000000
21344,6,20240525,Familia,14,4405.16,61672.24,19,3245.907368,73.684211
21376,6,20240626,Familia,11,2446.84,26915.25,20,1345.762500,55.000000
21862,6,20251025,Familia,13,2626.18,34140.38,19,1796.862105,68.421053

In [77]:
#Cálculo das medidas estatísticas
array_revpar = np.array(df_revpar['revpar'])
media_revpar = np.mean(array_revpar)
mediana_revpar = np.median(array_revpar)
q1_revpar = np.quantile(array_revpar, 0.25)
q2_revpar = np.quantile(array_revpar, 0.50)
q3_revpar = np.quantile(array_revpar, 0.75)
distancia_revpar = (media_revpar-mediana_revpar)/ mediana_revpar

#Cálculo dos limites para detecção de outliers
iqr_revpar = q3_revpar - q1_revpar
limite_superior_revpar = q3_revpar + 1.5 * iqr_revpar
limite_inferior_revpar = q1_revpar - 1.5 * iqr_revpar

#Resultados
print(f'A média é {media_revpar}')
print(f'A mediana é {mediana_revpar}')
print(f'Primeiro quartil (Q1): {q1_revpar}')
print(f'Segundo quartil (Q2, Mediana): {q2_revpar}')
print(f'Terceiro quartil (Q3): {q3_revpar}')
print(f'a distancia entre a média e a mediana é: {distancia_revpar}')
print(f'o valor do limite superior é: {limite_superior_revpar}')
print(f'o valor do limite inferior é: {limite_inferior_revpar}')

A média é 308.89653279182653
A mediana é 284.59541666666667
Primeiro quartil (Q1): 218.08570833333334
Segundo quartil (Q2, Mediana): 284.59541666666667
Terceiro quartil (Q3): 370.2499342105263
a distancia entre a média e a mediana é: 0.08538829054166613
o valor do limite superior é: 598.4962730263157
o valor do limite inferior é: -10.1606304824561

In [78]:
outliers_revpar = df_revpar.loc[df_revpar['revpar'] > limite_superior_revpar]
outliers_revpar

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_disponiveis,revpar,ocupacao
118,1,20240428,Standard,28,2682.70,75115.66,50,1502.313200,56.000000
213,1,20240801,Standard,32,1696.01,54272.46,53,1024.008679,60.377358
499,1,20250514,Standard,28,1529.24,42818.78,52,823.438077,53.846154
565,1,20250719,Standard,45,2866.73,129003.06,54,2388.945556,83.333333
700,1,20251201,Standard,33,1921.82,63420.22,55,1153.094909,60.000000
...,...,...,...,...,...,...,...,...,...
21862,6,20251025,Familia,13,2626.18,34140.38,19,1796.862105,68.421053
21904,6,20251206,Familia,15,760.53,11408.02,19,600.422105,78.947368
21908,6,20251210,Familia,14,868.73,12162.18,20,608.109000,70.000000
21911,6,20251213,Familia,18,740.55,13329.98,20,666.499000,90.000000
21912,6,20251214,Familia,16,880.16,14082.49,20,704.124500,80.000000

In [74]:
df_alta_ocupaçao = df_revpar.loc[df_revpar['ocupacao'] > 80 ]
df_alta_ocupaçao

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_disponiveis,revpar,ocupacao
4,1,20240105,Standard,54,332.37,17948.08,55,326.328727,98.181818
6,1,20240107,Standard,48,410.44,19701.21,54,364.837222,88.888889
7,1,20240108,Standard,42,293.63,12332.55,52,237.164423,80.769231
9,1,20240110,Standard,46,322.72,14844.96,55,269.908364,83.636364
11,1,20240112,Standard,43,371.99,15995.72,52,307.610000,82.692308
...,...,...,...,...,...,...,...,...,...
21814,6,20250907,Familia,17,731.75,12439.72,20,621.986000,85.000000
21815,6,20250908,Familia,17,469.30,7978.17,20,398.908500,85.000000
21884,6,20251116,Familia,14,671.08,9395.13,17,552.654706,82.352941
21909,6,20251211,Familia,17,648.87,11030.76,20,551.538000,85.000000
21911,6,20251213,Familia,18,740.55,13329.98,20,666.499000,90.000000

In [73]:
df_revpar_neg = df_revpar.loc[df_revpar['receita_diarias'] < 0]
df_revpar_neg

Empty DataFrame
Columns: [hotel_id, data_id, tipo_quarto, quartos_vendidos, adr_estimado, receita_diarias, quartos_disponiveis, revpar, ocupacao]
Index: []